# Parameters
nc: 8  # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

ch: 4  # input channels (RGB + Thermal)

# ========================================================================
# Dual-Stream Backbone (双流骨干网络)
# ========================================================================
backbone:
  # ====== Input Preprocessing ======
  - [-1, 1, Silence, []]                # 0-P1/2

  # ====== RGB Stream (可见光分支 0-2通道) ======
  - [0, 1, SilenceChannel, [0, 3]]      # 1-P1/2 (提取RGB)
  - [-1, 1, Conv, [64, 3, 2]]           # 2-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 3-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 4
  - [-1, 1, Conv, [256, 3, 2]]          # 5-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 6 (RGB-P3)

  # ====== Thermal Stream (红外分支 3通道) ======
  - [0, 1, SilenceChannel, [3, 4]]      # 7-P1/2 (提取Thermal)
  - [-1, 1, Conv, [64, 3, 2]]           # 8-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 9-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 10
  - [-1, 1, Conv, [256, 3, 2]]          # 11-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 12 (Thermal-P3)

  # ====== Mid-Fusion at P3 (P3阶段融合) ======
  - [[6, 12], 1, Concat, [1]]           # 13
  - [-1, 1, Conv, [512, 1, 1]]          # 14 (通道降维)

  # ====== Shared Deeper Layers (共享深层) ======
  - [-1, 1, Conv, [512, 3, 2]]          # 15-P4/16
  - [-1, 2, C3k2, [512, True]]          # 16
  - [-1, 1, Conv, [1024, 3, 2]]         # 17-P5/32
  - [-1, 2, C3k2, [1024, True]]         # 18
  - [-1, 1, SPPF, [1024, 5]]            # 19
  - [-1, 2, C2PSA, [1024]]              # 20

head:
  # =======================================================================
  # 阶段 1: 可见光特征收集 (RGB Semantic Collection)
  # =======================================================================
  - [2, 1, nn.MaxPool2d, [8, 8]]        # 21 (RGB P1 /2 -> /16)
  - [4, 1, nn.MaxPool2d, [4, 4]]        # 22 (RGB P2 /4 -> /16)
  - [6, 1, nn.MaxPool2d, [2, 2]]        # 23 (RGB P3 /8 -> /16)
  - [[21, 22, 23], 1, Concat, [1]]      # 24 (Concat RGB multi-scale, 都是/16)
  - [-1, 1, Conv, [256, 1, 1]]          # 25 (统一通道数到256)

  # =======================================================================
  # 阶段 2: 红外特征收集 (Thermal Semantic Collection)
  # =======================================================================
  - [8, 1, nn.MaxPool2d, [8, 8]]        # 26 (Thermal P1 /2 -> /16)
  - [10, 1, nn.MaxPool2d, [4, 4]]       # 27 (Thermal P2 /4 -> /16)
  - [12, 1, nn.MaxPool2d, [2, 2]]       # 28 (Thermal P3 /8 -> /16)
  - [[26, 27, 28], 1, Concat, [1]]      # 29 (Concat Thermal multi-scale, 都是/16)
  - [-1, 1, Conv, [256, 1, 1]]          # 30 (统一通道数到256)

  # =======================================================================
  # 阶段 3: 跨模态协同增强 (Cross-Modal Enhancement)
  # =======================================================================
  - [[25, 30], 1, DCFA, [256, 8, True]]  # 31 DCFA_Enhanced

  # =======================================================================
  # 阶段 4: 模态特定超图计算 (Modality-Specific Hypergraph)
  # =======================================================================
  - [31, 1, CAH, [256,8,2,True,4,0.1,'both',True]]  # 32 (RGB超图, /16)
  - [31, 1, CAH, [256,8,2,True,4,0.1,'both',True]]  # 33 (Thermal超图, /16)

  # =======================================================================
  # 阶段 5: 超图特征融合
  # =======================================================================
  - [[32, 33], 1, Concat, [1]]          # 34 (Concat: RGB超图 + Thermal超图, /16)
  - [-1, 1, Conv, [256, 1, 1]]          # 35 (通道降维到256)
  - [-1, 2, C3k2, [256, False]]         # 36 (深度融合, /16) - 基础超图特征 256*width

  # =======================================================================
  # 阶段 6: FPN Top-Down Path + FullPAD注入
  # =======================================================================
  - [20, 1, nn.Upsample, [None, 2, "nearest"]]  # 37 (C2PSA /32 -> /16)
  - [[-1, 16], 1, Concat, [1]]                  # 38 (cat: C2PSA_up + P4)
  - [-1, 1, Conv, [512, 1, 1]]                  # 39 (通道统一到512)

  # --- P4 FullPAD注入 (Top-Down) ---
  - [36, 1, Conv, [512, 1, 1]]                  # 40 (超图特征对齐到512)
  - [[39, 40], 1, FullPAD_Tunnel, []]           # 41 P4注入 (512 + 512)
  - [-1, 2, C3k2, [512, False]]                 # 42 (P4-FPN)

  - [42, 1, nn.Upsample, [None, 2, "nearest"]]  # 43 (P4 /16 -> /8)
  - [[-1, 14], 1, Concat, [1]]                  # 44 (cat: P4_up + P3)
  - [-1, 1, Conv, [256, 1, 1]]                  # 45 (通道统一到256)

  # --- P3 FullPAD注入 (Top-Down) ---
  - [36, 1, nn.Upsample, [None, 2, "nearest"]]  # 46 (超图 /16 -> /8)
  - [-1, 1, Conv, [256, 1, 1]]                  # 47 (超图特征保持256)
  - [[45, 47], 1, FullPAD_Tunnel, []]           # 48 P3注入 (256 + 256)
  - [-1, 2, C3k2, [256, False]]                 # 49 (P3-FPN)

  # =======================================================================
  # 阶段 7: FPN Bottom-Up Path + FullPAD注入
  # =======================================================================
  - [49, 1, Conv, [256, 3, 2]]          # 50 (P3 /8 -> /16)
  - [[-1, 42], 1, Concat, [1]]          # 51 (cat: P3_down + P4_topdown)
  - [-1, 1, Conv, [512, 1, 1]]          # 52 (通道统一到512)

  # --- P4 FullPAD二次注入 (Bottom-Up) ---
  - [40, 1, nn.Identity, []]            # 53 (复用P4超图特征)
  - [[52, 53], 1, FullPAD_Tunnel, []]   # 54 P4二次注入 (512 + 512)
  - [-1, 2, C3k2, [512, False]]         # 55 (N4)

  - [55, 1, Conv, [512, 3, 2]]          # 56 (N4 /16 -> /32)
  - [[-1, 20], 1, Concat, [1]]          # 57 (cat: N4_down + C2PSA)
  - [-1, 1, Conv, [1024, 1, 1]]         # 58 (通道统一到1024)

  # --- P5 FullPAD注入 (Bottom-Up) ---
  - [36, 1, Conv, [1024, 3, 2]]         # 59 (超图 /16 -> /32, 对齐到1024)
  - [[58, 59], 1, FullPAD_Tunnel, []]   # 60 P5注入 (1024 + 1024)
  - [-1, 2, C3k2, [1024, True]]         # 61 (N5)

  # =======================================================================
  # 阶段 8: 检测头
  # =======================================================================
  - [[49, 55, 61], 1, Detect, [nc]]     # 62 Detect(P3, P4, P5)

